# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap "homebrew/services"

# Binaries
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'exa'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'mc'
brew 'mas' # Mac App Store manager
brew "openssl"
brew "zsh"

# Development
brew 'php@8.1', restart_service: :changed
brew 'php@7.4', restart_service: :changed
brew 'composer'
brew 'imagemagick'
brew 'caddy', restart_service: :changed
brew 'mysql', restart_service: :changed
brew 'node'
brew 'redis', restart_service: :changed
brew 'yarn'

# Image optimizer
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Apps
cask '1password'
cask 'adobe-acrobat-reader'
cask 'bbedit'
cask 'caffeine'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'libreoffice'
cask 'responsively'
cask 'sequel-ace'
cask 'stats'
cask 'sourcetree'
cask 'the-unarchiver'
cask 'transmit'
cask 'whatsapp'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
